Nama  :    
Batch :   
Objective :

# Data Science Salaries

## Introduction

Melakukan analisa terhadap Data Science Salaries melalui data processing. 
Tujuannya untuk belajar.

In [1]:
import pandas as pd

## Data Loading

In [35]:
# Membaca file csv 
data = pd.read_csv("./ds_salaries.csv")
data.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

11

## Data Knowledge

In [41]:
# Summary data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [42]:
# List column
print(data.columns)
# Total column
len(data.columns)

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

11

Dataset data science salaries memiliki total 3755 rows dengan 11 column.
11 columns terdiri dari : 
- 'work_year'
- 'experience_level'
- 'employment_type'
- 'job_title','salary'
- 'salary_currency'
-'salary_in_usd'
- 'employee_residence',
- 'remote_ratio'
- 'company_location'
- 'company_size'

In [46]:
dataResidences = data['employee_residence'].unique()
# Total data data residences
print(len(dataResidences))
dataResidences

78

array(['ES', 'US', 'CA', 'DE', 'GB', 'NG', 'IN', 'HK', 'PT', 'NL', 'CH',
       'CF', 'FR', 'AU', 'FI', 'UA', 'IE', 'IL', 'GH', 'AT', 'CO', 'SG',
       'SE', 'SI', 'MX', 'UZ', 'BR', 'TH', 'HR', 'PL', 'KW', 'VN', 'CY',
       'AR', 'AM', 'BA', 'KE', 'GR', 'MK', 'LV', 'RO', 'PK', 'IT', 'MA',
       'LT', 'BE', 'AS', 'IR', 'HU', 'SK', 'CN', 'CZ', 'CR', 'TR', 'CL',
       'PR', 'DK', 'BO', 'PH', 'DO', 'EG', 'ID', 'AE', 'MY', 'JP', 'EE',
       'HN', 'TN', 'RU', 'DZ', 'IQ', 'BG', 'JE', 'RS', 'NZ', 'MD', 'LU',
       'MT'], dtype=object)

In [48]:
dataCompanySizes = data['company_size'].unique()
# Total data comapny sizes
print(len(dataCompanySizes))
dataCompanySizes

3

array(['L', 'S', 'M'], dtype=object)

Terdapat uniq data pada company size yaitu L, S dan M. Sementara untuk residence terdapat 78 dari seluruh negara.

## Data Cleaning

In [50]:
data.isnull().any()

work_year             False
experience_level      False
employment_type       False
job_title             False
salary                False
salary_currency       False
salary_in_usd         False
employee_residence    False
remote_ratio          False
company_location      False
company_size          False
dtype: bool

Telah dilakukan pengecekan missing value. Tidak ditemukan data yang missing maka tidak ada process data cleaning

https://blog.hubspot.com/website/duplicated-pandas

In [51]:
data.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [94]:
# duplicate dataframe 
df = data.copy()
# drop 3 column
df = df.drop(['salary','salary_currency','remote_ratio'], axis=1)

df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,ES,L
1,2023,MI,CT,ML Engineer,30000,US,US,S
2,2023,MI,CT,ML Engineer,25500,US,US,S
3,2023,SE,FT,Data Scientist,175000,CA,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,CA,M

In [95]:
df = df.rename(columns={"employment_type": "type", "salary_in_usd": "salary"})
df.head()

,work_year,experience_level,type,job_title,salary,employee_residence,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,ES,L
1,2023,MI,CT,ML Engineer,30000,US,US,S
2,2023,MI,CT,ML Engineer,25500,US,US,S
3,2023,SE,FT,Data Scientist,175000,CA,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,CA,M

In [96]:
# salary remove currency and symbol 
df['salary'] = df['salary'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   type                3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   employee_residence  3755 non-null   object
 6   company_location    3755 non-null   object
 7   company_size        3755 non-null   object
dtypes: int64(2), object(6)
memory usage: 234.8+ KB

In [97]:
df.head()

,work_year,experience_level,type,job_title,salary,employee_residence,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,ES,L
1,2023,MI,CT,ML Engineer,30000,US,US,S
2,2023,MI,CT,ML Engineer,25500,US,US,S
3,2023,SE,FT,Data Scientist,175000,CA,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,CA,M

In [59]:
df.to_csv('data_clean.csv', index=False)

## Normalisasi

Proses normalisasi hingga 3NF menghasilkan 3 table yaitu table utama merupakan salaries, dan 2 table lainnya adalah residences dan companySizes. Berikut hubungan antar table: 
- 1 Residence memiliki banyak Salary. Melalui primary key id di Residences menjadi foreign di Salaries dengan nama residence_id. 
- 1 CompanySize memiliki banyak Salary. Melalui primary key id di CompanySizes menjadi foreign di Salaries dengan nama companysize_id.

In [62]:
# membuat csv untuk table residences
dataPandaResidence = pd.DataFrame({
  "residence" : dataResidences
})
dataPandaResidence.to_csv("residences.csv", index=False)

In [65]:
# membuat csv untuk table companySize
dataPandaCompanySize = pd.DataFrame({
  "size":dataCompanySizes
})
dataPandaCompanySize.to_csv("companySizes.csv", index=False)

In [99]:
# print(df["employee_residence"])
# print(dataPandaResidence)
              #  pembanding, list dari csv, new name di main table
def generateFK(name_replace, dataUniq, nameFK):
  result = []
  datalist = dataUniq.to_list()
  # loop data 3000an sekian
  for el in df[name_replace]:
    # list dengan string/calue 
    result.append(datalist.index(el) + 1)
  df[nameFK] = result
  return result


print(generateFK("employee_residence", dataPandaResidence['residence'], 'residence_id'))
print(generateFK("company_size", dataPandaCompanySize['size'], 'companySize_id'))

df = df.drop(['employee_residence','company_size'], axis=1)
df.head()

[1, 2, 2, 3, 3, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 4, 5, 5, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 6, 6, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 8, 9, 7, 7, 10, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 11, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 12, 12, 2, 2, 2, 2, 5, 5, 6, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 7, 14, 15, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 16, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 17, 17, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 10, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 16, 16, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 18, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 17, 17, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 19, 4, 3, 3, 2, 2, 5, 5, 2, 2, 5, 5, 5, 5, 2, 2, 2, 2, 11, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 17, 20, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 21, 21, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 22, 2, 2, 7, 7, 23, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 24, 24, 5, 5, 5, 5, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 25, 25, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 6, 26, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 7, 2, 2, 2, 27, 9, 26, 2, 2, 2, 2, 25, 25, 2, 2, 2, 4, 4, 2, 2, 7, 2, 2, 2, 2, 2, 2, 2, 2, 13, 28, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 4, 4, 4, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 19, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 29, 29, 30, 27, 2, 2, 2, 2, 2, 2, 2, 2, 13, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 31, 2, 2, 2, 2, 5, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 32, 2, 17, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 25, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 5, 5, 10, 2, 2, 2, 5, 5, 5, 5, 2, 2, 3, 3, 2, 2, 2, 2, 1, 1, 3, 10, 7, 2, 2, 5, 5, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 23, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 22, 33, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 34, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 13, 35, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 36, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 37, 38, 39, 7, 2, 2, 40, 40, 2, 2, 2, 2, 2, 2, 2, 2, 41, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 28, 7, 2, 2, 2, 2, 2, 2, 40, 40, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 1, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 9, 9, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 10, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 5, 5, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 14, 42, 2, 2, 2, 2, 2, 2, 13, 13, 2, 2, 2, 2, 3, 3, 2, 2, 42, 7, 2, 2, 2, 2, 43, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 44, 7, 30, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 7, 21, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 25, 25, 5, 5, 1, 1, 2, 2, 4, 2, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 3, 34, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 13, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 45, 45, 5, 5, 2, 2, 2, 2, 2, 34, 2, 2, 2, 2, 2, 2, 46, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 47, 4, 4, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 13, 13, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 1, 1, 2, 2, 48, 13, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 9, 9, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 43, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 47, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 49, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 25, 11, 43, 43, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 20, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 50, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 2, 13, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 51, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 25, 27, 27, 2, 2, 2, 2, 27, 27, 2, 2, 2, 2, 27, 27, 2, 2, 2, 2, 2, 2, 27, 27, 2, 5, 3, 2, 5, 2, 2, 2, 2, 7, 14, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 3, 2, 2, 14, 7, 9, 9, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 4, 2, 6, 2, 2, 9, 52, 2, 4, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 14, 14, 2, 2, 2, 53, 3, 3, 2, 2, 2, 2, 2, 2, 54, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 55, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 56, 56, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 1, 1, 2, 5, 7, 2, 2, 9, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 7, 15, 7, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 28, 1, 2, 2, 2, 2, 27, 2, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 2, 2, 2, 2, 2, 2, 2, 10, 2, 13, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 38, 38, 5, 5, 1, 1, 2, 2, 2, 2, 5, 5, 2, 2, 5, 5, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 57, 2, 2, 2, 2, 2, 2, 2, 2, 58, 58, 2, 2, 2, 2, 2, 59, 14, 2, 2, 9, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 10, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 7, 5, 2, 60, 2, 2, 2, 2, 2, 27, 2, 2, 2, 2, 2, 2, 2, 2, 10, 10, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 56, 56, 2, 2, 5, 5, 5, 2, 2, 2, 2, 2, 2, 7, 2, 2, 4, 2, 2, 2, 2, 2, 2, 34, 46, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 7, 20, 2, 10, 5, 34, 2, 2, 2, 2, 2, 2, 13, 46, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 13, 5, 5, 4, 2, 2, 2, 2, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 7, 7, 2, 2, 2, 54, 22, 2, 2, 2, 2, 2, 2, 2, 61, 2, 2, 2, 2, 9, 62, 2, 2, 14, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 4, 7, 5, 5, 2, 2, 2, 2, 2, 4, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 13, 2, 2, 2, 2, 2, 2, 38, 38, 3, 2, 2, 2, 2, 2, 2, 2, 2, 7, 5, 2, 2, 5, 5, 1, 1, 1, 1, 5, 5, 38, 38, 2, 2, 38, 38, 5, 5, 2, 2, 1, 1, 2, 2, 5, 5, 38, 38, 5, 5, 43, 34, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 3, 3, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 2, 2, 2, 2, 63, 63, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 2, 7, 7, 9, 4, 7, 58, 2, 3, 2, 17, 2, 3, 9, 38, 24, 64, 3, 2, 2, 2, 14, 65, 66, 10, 42, 13, 14, 2, 2, 27, 3, 30, 3, 67, 68, 52, 42, 20, 2, 2, 2, 2, 2, 2, 2, 2, 2, 11, 2, 13, 69, 42, 2, 65, 65, 14, 2, 3, 2, 70, 2, 4, 27, 32, 2, 2, 13, 7, 2, 4, 7, 2, 7, 2, 1, 5, 9, 2, 2, 1, 2, 71, 2, 46, 4, 13, 5, 2, 2, 2, 2, 2, 2, 4, 4, 38, 69, 69, 2, 2, 2, 13, 20, 3, 2, 16, 3, 2, 2, 2, 2, 2, 2, 6, 42, 7, 2, 5, 1, 43, 30, 2, 5, 2, 13, 72, 6, 2, 2, 4, 2, 2, 59, 2, 13, 2, 7, 1, 2, 4, 9, 38, 5, 5, 4, 7, 2, 2, 3, 5, 2, 5, 49, 2, 4, 4, 2, 5, 22, 7, 2, 2, 27, 2, 2, 2, 2, 7, 9, 2, 13, 7, 25, 2, 5, 54, 13, 5, 2, 3, 2, 2, 3, 7, 10, 63, 3, 65, 2, 2, 2, 5, 2, 2, 2, 4, 2, 2, 10, 73, 2, 2, 54, 1, 2, 2, 13, 10, 4, 2, 2, 4, 54, 2, 2, 56, 74, 7, 7, 4, 2, 4, 7, 3, 49, 2, 4, 7, 7, 37, 2, 3, 2, 2, 21, 75, 13, 7, 13, 32, 13, 2, 41, 4, 7, 7, 2, 55, 2, 4, 2, 1, 2, 2, 2, 5, 7, 5, 30, 42, 65, 30, 46, 7, 9, 57, 4, 7, 38, 2, 8, 13, 24, 2, 43, 2, 2, 57, 2, 13, 38, 27, 2, 7, 13, 2, 4, 4, 43, 2, 2, 2, 3, 5, 42, 41, 65, 2, 76, 69, 2, 27, 77, 4, 4, 1, 1, 7, 20, 13, 2, 2, 7, 27, 2, 2, 2, 10, 2, 2, 2, 1, 29, 65, 22, 2, 78, 2, 2, 2, 2, 2, 7]

,work_year,experience_level,type,job_title,salary,company_location,residence_id,companySize_id
0,2023,SE,FT,Principal Data Scientist,85847,ES,1,1
1,2023,MI,CT,ML Engineer,30000,US,2,2
2,2023,MI,CT,ML Engineer,25500,US,2,2
3,2023,SE,FT,Data Scientist,175000,CA,3,3
4,2023,SE,FT,Data Scientist,120000,CA,3,3

In [100]:
# create main table csv (FIXED)
# df.to_csv("C:\tmp\salaries_table.csv", index=False)
df.to_csv("salaries_table.csv", index=False)

## Relational Database & SQL

In [ ]:
# ikut csv mu untuk nama column.... 

CREATE TABLE residences (
  id SERIAL PRIMARY KEY, 
  residence VARCHAR 
)

CREATE TABLE "companySizes" (
  id SERIAL PRIMARY KEY, 
  size VARCHAR 
)

CREATE TABLE salaries (
  id SERIAL PRIMARY KEY, 
  work_year INT,
  experience_level VARCHAR,
  type VARCHAR,
  job_title VARCHAR,
  salary INT,
  company_location VARCHAR,
  residence_id INT,
  "companySize_id" INT, 
  FOREIGN KEY (residence_id) REFERENCES residences(id),
  FOREIGN KEY ("companySize_id") REFERENCES "companySizes"(id)
)

---

### Info 
1. Business Understanding 
- SMART Analysis
- Problem Statement from SMART Analysis 
- 5W1H 
2. Data Loading
3. Data Knowledge
4. Data Cleaning
5. Data Transform
6. Descriptive Statistic
7. Statistic Inferensial by answer 5W1H